In [1]:
# import prices from csv file
import pandas as pd
prices = pd.read_csv("data/price.csv", index_col=0, header=0, parse_dates=True)

In [2]:
# connect with MongoDB (here using a mock database)
from mongoengine import *
connect(db="test", host='mongomock://localhost', alias='default')

mongomock.MongoClient('localhost', 27017)

In [3]:
from pyutil.mongo.engine.symbol import Symbol, Group

# Here you can go wild and point to an existing MongoDB Server. I use an inmemory-solution here...
g = Group(name="US Stock").save()

In [4]:
for key, data in prices.items():
    symbol = Symbol(name=key, group=g, internal=key, price=data.dropna()).save()
    # upsert the prices
    #symbol.price = data.dropna()
    #symbol.save()

In [5]:
for symbol in Symbol.objects:
    print(symbol.name)
    print(symbol.group.name)
    print(symbol.internal)
    print(symbol.price.tail(3))

A
US Stock
A
2015-04-20    1195.88
2015-04-21    1202.34
2015-04-22    1200.59
Name: A, dtype: float64
B
US Stock
B
2015-04-20    27094.93
2015-04-21    27850.49
2015-04-22    27964.84
Name: B, dtype: float64
C
US Stock
C
2015-04-16    54674.21
2015-04-17    53954.79
2015-04-20    53761.27
Name: C, dtype: float64
D
US Stock
D
2015-04-20    2667.63
2015-04-21    2651.41
2015-04-22    2638.95
Name: D, dtype: float64
E
US Stock
E
2015-04-17    2081.18
2015-04-20    2100.40
2015-04-21    2097.29
Name: E, dtype: float64
F
US Stock
F
2015-04-20    3718.04
2015-04-21    3719.38
2015-04-22    3742.77
Name: F, dtype: float64
G
US Stock
G
2015-04-17    3061.38
2015-04-20    3059.73
2015-04-21    3065.53
Name: G, dtype: float64

In [6]:
s1 = Symbol.objects(name="A").get()
print(s1.name)
print(s1.group.name)
s1.reference["AA"] = 20.0
s1.reference["BB"] = 30.0
s1.save()

s2 = Symbol.objects(name="C").get()
print(s2.name)
print(s2.group.name)
s2.reference["BB"] = 40.0
s2.reference["CC"] = 30.0
s2.save()

Symbol.reference_frame(products=[s1,s2])

A
US Stock
C
US Stock

          AA    BB    CC    Sector Internal
symbol
A       20.0  30.0   NaN  US Stock        A
C        NaN  40.0  30.0  US Stock        C

In [7]:
Symbol.pandas_frame(item="price", products=[s1,s2])

symbol            A         C
2013-01-01  1673.78  62550.10
2013-01-02  1686.90  62550.10
2013-01-03  1663.95  63312.46
2013-01-04  1655.65  62523.06
2013-01-07  1646.95  61932.54
...             ...       ...
2015-04-16  1198.56  54674.21
2015-04-17  1204.27  53954.79
2015-04-20  1195.88  53761.27
2015-04-21  1202.34       NaN
2015-04-22  1200.59       NaN

[602 rows x 2 columns]